tutorials/pureDEM/HFDIBDEMFoam/fallingArbShapeParticle/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames ("icoSphere");
interpolationSchemes
{
  //~ U cellPointFace;
  U cell;
}

surfaceThreshold    1e-4;

// DEM settings
stepDEM     0.1;

// adaptive DEM stepping option (sub-cycling of contacting bodies)
// adaptiveStepDEM true;
// adaptiveStepDEMDict
// {
//     DEMdtEstimator  velocityAware; // or conservative
//     sweepSafetyTrans 1.5;
//     sweepSafetyRot   3.0;
//     minDEMdt         0;
//     maxDEMSubCycles  0; // 0 = unlimited
// }

geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain 1000;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default

outputSetup
{
    basic true;
    iB  true;
    DEM true;
    addModel false;
    parallelDEM false;
}
DEM
{
	LcCoeff 4.0;
	rotationModel chen2012;
	// rotationModel mindlin1953
    materials
    {
        particle
        {
            Y       6e8;
            // nu      0.5;
            nu      0.0;
            mu      0;
            adhN    0;
			eps     1;
        }
        
        wall
        {
            Y       1e8;
            // nu      0.5;
            nu      0.0;
            mu      0;
            adhN    0;
			eps 	1;
        }   
    }
	
    collisionPatches
    {
		wall0
		{
			material wall;
			nVec (1.0 0.0 0.0);
			planePoint (0.015 0.00 0.0);
		}
		wall1
		{
			material wall;
			nVec (0.0 0.0 1.0);
			planePoint (0.0 0.0 0.015);
		}
		wall2
		{
			material wall;
			nVec (-1.0 0.0 0.0);
			planePoint (-0.015 0.0 0.0);
		}
		wall3
		{
			material wall;
			nVec (0.0 0.0 -1.0);
			planePoint (0.0 0.0 -0.015);
		}
		bot
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.0 -0.05 0.0);
		}
    }
}

virtualMesh
{
    level 4;
    charCellSize 0.001;
    recordContact false;
}

icoSphere
{

	fullyCoupledBody
	{
		velocity (0 -1.0 0);
	}

	rho         rho [1 -3 0 0 0 0 0] 4000;

	refineMC 5;

	U
	{
	BC  noSlip;
	}

	bodyAddition
	{
		addModel   once;//<-constant, only once
		onceCoeffs{}
	}
		
	material particle;
	bodyGeom convex;
	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 2;
	timesToSetStatic -1;
	
}

// ************************************************************************* //

